print("Індивідуальне завдання на обробку рядків двома способами. Варіaнт 3, Задача 2")
a = input('Введіть строку')
way = int(input("Виберіть спосіб "))
while True:
    if way == 1:                                    #спосіб 1 через методи
        print(a.replace('1', 'один'))
    elif way == 2:                                  #спосіб 2
        if a.count('1') == 0:                       #перевірка на наявність "1"
            print(a)
        else:
            wide = [0] * a.count('1')               # пустий лист з комірцями для кожного індексу 1
            c = len(a)
            x = 0
            i2 = 0
            x1 = 0
            word = ''                               # майбутня вихідна строка
            for i in wide:                          # назначаємо в списку всі індекси одиниць
                wide[x] = a.find('1', i2, c )    #
                i2 = wide[x] + 1                    #
                x += 1
            for ii in wide:
                word += a[x1+1:ii] + "один"         # збираємо строку з "один" замість 1
                x1 = ii
        print(a[0]+word + a[wide[-1] + 1:])
    else: print("Способу "+str(way)+" не існує!")
    break