a = (input("Введіть координати точки А через пробіл: ").split(" "))
while len(a) != 3:
    print("Координати введено неправильно!")
    a = (input("Введіть координати точки А через пробіл: ").split(" "))
b = (input("Введіть координати точки B через пробіл: ").split(" "))
while len(b) != 3:
    print("Координати введено неправильно!")
    b = (input("Введіть координати точки B через пробіл: ").split(" "))
c = (input("Введіть координати точки C через пробіл: ").split(" "))
while len(c) != 3:
    print("Координати введено неправильно!")
    c = (input("Введіть координати точки C через пробіл: ").split(" "))
d = (input("Введіть координати точки D через пробіл: ").split(" "))  # координати точок
while len(c) != 3:  # перевірка на правильність вхідних даних
    print("Координати введено неправильно!")
    d = (input("Введіть координати точки D через пробіл: ").split(" "))
ab = [1] * 3
cd = [1] * 3
for i in range(0, 3):  # Знаходження координат вектора АВ
    ab[i] = int(b[i]) - int(a[i])
for ii in range(0, 3):  # Знаходження координат вектора CD
    cd[ii] = int(d[ii]) - int(c[ii])
scalar = ab[0] * cd[0] + ab[1] * cd[1] + ab[2] * cd[2]  # Скалярний добуток за формулою x1*x2+y1*y2+z1*z2
print("Скалярний добуток векторів АВ {} та CD {} : {}".format(ab, cd, scalar))
